#pragma once

#include <cstdint>

namespace libmcc {
    enum e_customization_item : uint32_t;

    struct s_player_customization {
        e_customization_item helmet_index; // 0x40
        e_customization_item left_shoulder_index; // 0x44
        e_customization_item right_shoulder_index; // 0x48
        e_customization_item chest_index; // 0x4C
        e_customization_item wrist_index; // 0x50
        e_customization_item utility_index; // 0x54
        e_customization_item arms_index; // 0x58
        e_customization_item legs_index; // 0x5C
        e_customization_item backpack_index; // 0x60
        e_customization_item spartan_body_index; // 0x64
        e_customization_item spartan_armor_effect_index; // 0x68
        e_customization_item knees_index; // 0x6C
        e_customization_item visor_color_index; // 0x70
        e_customization_item elite_helmet_index; // 0x74
        e_customization_item elite_left_shoulder_index; // 0x78
        e_customization_item elite_right_shoulder_index; // 0x7C
        e_customization_item elite_chest_index; // 0x80
        e_customization_item elite_arms_index; // 0x84
        e_customization_item elite_legs_index; // 0x88
        e_customization_item elite_armor_index; // 0x8C
        e_customization_item elite_armor_effect_index; // 0x90
        e_customization_item voice_index; // 0x94
        e_customization_item player_model_primary_color; // 0x98
        e_customization_item player_model_secondary_color; // 0x9C
        e_customization_item player_model_tertiary_color; // 0xA0
        e_customization_item spartan_pose; // 0xA4
        e_customization_item elite_pose; // 0xA8
        struct skin_t { int object; e_customization_item skin; } skins[32]; // 0xAC
    };

	static_assert(sizeof(s_player_customization) == 0x16C);

    enum e_customization_item : uint32_t {
        _customization_item_hr_helmet_markvb_base,
        _customization_item_hr_helmet_markvb_ua,
        _customization_item_hr_helmet_markvb_uahul,
        _customization_item_hr_helmet_cqc_base,
        _customization_item_hr_helmet_cqc_cbrn,
        _customization_item_hr_helmet_cqc_uahul,
        _customization_item_hr_helmet_odst_base,
        _customization_item_hr_helmet_odst_uacnm,
        _customization_item_hr_helmet_odst_cbrnhul,
        _customization_item_hr_helmet_hazop_base,
        _customization_item_hr_helmet_hazop_cbrnhul,
        _customization_item_hr_helmet_hazop_cnmi,
        _customization_item_hr_helmet_eod_base,
        _customization_item_hr_helmet_eod_cnm,
        _customization_item_hr_helmet_eod_uahul,
